using System;
using System.Collections.Generic;
using System.IO;
using System.Linq;
using System.Text;
using 文字列 = System.String;
using 文字 = System.Char;
using 文字ｺーﾄﾞー = System.Text.Encoding;
using その結果 = System.Boolean;
using 妄想配列 = System.Collections.Generic.Dictionary<char, string>;

namespace ｼﾓﾅｲｻﾞー
{
    public static class ｼﾓﾅｲｻﾞーExtension
    {
        static 妄想配列 ｼﾓﾅｲｽﾞﾃーﾌﾞﾙ = new 妄想配列{
            {'ガ',"ｶﾞ"},{'ギ',"ｷﾞ"},{'グ',"ｸﾞ"},{'ゲ',"ｹﾞ"},{'ゴ',"ｺﾞ"},
            {'ザ',"ｻﾞ"},{'ジ',"ｼﾞ"},{'ズ',"ｽﾞ"},{'ゼ',"ｾﾞ"},{'ゾ',"ｿﾞ"},
            {'ダ',"ﾀﾞ"},{'ヂ',"ﾁﾞ"},{'ヅ',"ﾂﾞ"},{'デ',"ﾃﾞ"},{'ド',"ﾄﾞ"},
            {'バ',"ﾊﾞ"},{'ビ',"ﾋﾞ"},{'ブ',"ﾌﾞ"},{'ベ',"ﾍﾞ"},{'ボ',"ﾎﾞ"},
            {'パ',"ﾊﾟ"},{'ピ',"ﾋﾟ"},{'プ',"ﾌﾟ"},{'ペ',"ﾍﾟ"},{'ポ',"ﾎﾟ"},
            {'ヴ',"ｳﾞ"},
            {'ア',"ｱ"},{'イ',"ｲ"},{'ウ',"ｳ"},{'エ',"ｴ"},{'オ',"ｵ"},
            {'カ',"ｶ"},{'キ',"ｷ"},{'ク',"ｸ"},{'ケ',"ｹ"},{'コ',"ｺ"},
            {'サ',"ｻ"},{'シ',"ｼ"},{'ス',"ｽ"},{'セ',"ｾ"},{'ソ',"ｿ"},
            {'タ',"ﾀ"},{'チ',"ﾁ"},{'ツ',"ﾂ"},{'テ',"ﾃ"},{'ト',"ﾄ"},
            {'ナ',"ﾅ"},{'ニ',"ﾆ"},{'ヌ',"ﾇ"},{'ネ',"ﾈ"},{'ノ',"ﾉ"},
            {'ハ',"ﾊ"},{'ヒ',"ﾋ"},{'フ',"ﾌ"},{'ヘ',"ﾍ"},{'ホ',"ﾎ"},
            {'マ',"ﾏ"},{'ミ',"ﾐ"},{'ム',"ﾑ"},{'メ',"ﾒ"},{'モ',"ﾓ"},
            {'ヤ',"ﾔ"},{'ユ',"ﾕ"},{'ヨ',"ﾖ"},
            {'ラ',"ﾗ"},{'リ',"ﾘ"},{'ル',"ﾙ"},{'レ',"ﾚ"},{'ロ',"ﾛ"},
            {'ワ',"ﾜ"},{'ヲ',"ｦ"},{'ン',"ﾝ"},
            {'ァ',"ｧ"},{'ィ',"ｨ"},{'ゥ',"ｩ"},{'ェ',"ｪ"},{'ォ',"ｫ"},
            {'ャ',"ｬ"},{'ュ',"ｭ"},{'ョ',"ｮ"},{'ッ',"ｯ"}
        };

        public static 文字列 ｼﾓﾅｲｽﾞ(this 文字列 閣下)
        {
            foreach(var 相当 in ｼﾓﾅｲｽﾞﾃーﾌﾞﾙ) {
                if (閣下.Contains(相当.Key)) {
                    閣下 = 閣下.Replace(相当.Key.ToString(), 相当.Value);
                }
            }
            return 閣下;
        }
    }
}
