library(magrittr)
library(stringr)

# ｼﾓﾅｲｽﾞ前後の文字対応表
Simonize.table = list(
  `ガ` = "ｶﾞ", `ギ` = "ｷﾞ", `グ` = "ｸﾞ", `ゲ` = "ｹﾞ", `ゴ` = "ｺﾞ",
  `ザ` = "ｻﾞ", `ジ` = "ｼﾞ", `ズ` = "ｽﾞ", `ゼ` = "ｾﾞ", `ゾ` = "ｿﾞ",
  `ダ` = "ﾀﾞ", `ヂ` = "ﾁﾞ", `ヅ` = "ﾂﾞ", `デ` = "ﾃﾞ", `ド` = "ﾄﾞ",
  `バ` = "ﾊﾞ", `ビ` = "ﾋﾞ", `ブ` = "ﾌﾞ", `ベ` = "ﾍﾞ", `ボ` = "ﾎﾞ",
  `パ` = "ﾊﾟ", `ピ` = "ﾋﾟ", `プ` = "ﾌﾟ", `ペ` = "ﾍﾟ", `ポ` = "ﾎﾟ",
  `ヴ` = "ｳﾞ",
  `ア` = "ｱ", `イ` = "ｲ", `ウ` = "ｳ", `エ` = "ｴ", `オ` = "ｵ",
  `カ` = "ｶ", `キ` = "ｷ", `ク` = "ｸ", `ケ` = "ｹ", `コ` = "ｺ",
  `サ` = "ｻ", `シ` = "ｼ", `ス` = "ｽ", `セ` = "ｾ", `ソ` = "ｿ",
  `タ` = "ﾀ", `チ` = "ﾁ", `ツ` = "ﾂ", `テ` = "ﾃ", `ト` = "ﾄ",
  `ナ` = "ﾅ", `ニ` = "ﾆ", `ヌ` = "ﾇ", `ネ` = "ﾈ", `ノ` = "ﾉ",
  `ハ` = "ﾊ", `ヒ` = "ﾋ", `フ` = "ﾌ", `ヘ` = "ﾍ", `ホ` = "ﾎ",
  `マ` = "ﾏ", `ミ` = "ﾐ", `ム` = "ﾑ", `メ` = "ﾒ", `モ` = "ﾓ",
  `ヤ` = "ﾔ", `ユ` = "ﾕ", `ヨ` = "ﾖ",
  `ラ` = "ﾗ", `リ` = "ﾘ", `ル` = "ﾙ", `レ` = "ﾚ", `ロ` = "ﾛ",
  `ワ` = "ﾜ", `ヲ` = "ｦ", `ン` = "ﾝ",
  `ァ` = "ｧ", `ィ` = "ｨ", `ゥ` = "ｩ", `ェ` = "ｪ", `ォ` = "ｫ",
  `ャ` = "ｬ", `ュ` = "ｭ", `ョ` = "ｮ",
  `ッ` = "ｯ"
)

# 受け取った文字列をｼﾓﾅｲｽﾞする。
Simonize = function(plain.string) {
  char.simonize = function(char) {
    char %in% names(Simonize.table) %>%
      ifelse(Simonize.table[char], char)
  }

  simonized <- plain.string %>%
    strsplit("") %>%
    lapply(char.simonize) %>%
    unlist() %>%
    Reduce(f = function(x, y){ x <- paste0(x, y)})

  return(simonized)
}

'涼宮シモーネの憂鬱' %>% Simonize() %>% print()
