use utf8;
package ｼﾓﾅｲｻﾞー;

my %ｼﾓﾅｲｽﾞﾃーﾌﾞﾙ = (
    "ガ" => "ｶﾞ", "ギ" => "ｷﾞ", "グ" => "ｸﾞ", "ゲ" => "ｹﾞ", "ゴ" => "ｺﾞ",
    "ザ" => "ｻﾞ", "ジ" => "ｼﾞ", "ズ" => "ｽﾞ", "ゼ" => "ｾﾞ", "ゾ" => "ｿﾞ",
    "ダ" => "ﾀﾞ", "ヂ" => "ﾁﾞ", "ヅ" => "ﾂﾞ", "デ" => "ﾃﾞ", "ド" => "ﾄﾞ",
    "バ" => "ﾊﾞ", "ビ" => "ﾋﾞ", "ブ" => "ﾌﾞ", "ベ" => "ﾍﾞ", "ボ" => "ﾎﾞ",
    "パ" => "ﾊﾟ", "ピ" => "ﾋﾟ", "プ" => "ﾌﾟ", "ペ" => "ﾍﾟ", "ポ" => "ﾎﾟ",
    "ヴ" => "ｳﾞ",
    "ア" => "ｱ", "イ" => "ｲ", "ウ" => "ｳ", "エ" => "ｴ", "オ" => "ｵ",
    "カ" => "ｶ", "キ" => "ｷ", "ク" => "ｸ", "ケ" => "ｹ", "コ" => "ｺ",
    "サ" => "ｻ", "シ" => "ｼ", "ス" => "ｽ", "セ" => "ｾ", "ソ" => "ｿ",
    "タ" => "ﾀ", "チ" => "ﾁ", "ツ" => "ﾂ", "テ" => "ﾃ", "ト" => "ﾄ",
    "ナ" => "ﾅ", "ニ" => "ﾆ", "ヌ" => "ﾇ", "ネ" => "ﾈ", "ノ" => "ﾉ",
    "ハ" => "ﾊ", "ヒ" => "ﾋ", "フ" => "ﾌ", "ヘ" => "ﾍ", "ホ" => "ﾎ",
    "マ" => "ﾏ", "ミ" => "ﾐ", "ム" => "ﾑ", "メ" => "ﾒ", "モ" => "ﾓ",
    "ヤ" => "ﾔ", "ユ" => "ﾕ", "ヨ" => "ﾖ",
    "ラ" => "ﾗ", "リ" => "ﾘ", "ル" => "ﾙ", "レ" => "ﾚ", "ロ" => "ﾛ",
    "ワ" => "ﾜ", "ヲ" => "ｦ", "ン" => "ﾝ",
    "ァ" => "ｧ", "ィ" => "ｨ", "ゥ" => "ｩ", "ェ" => "ｪ", "ォ" => "ｫ",
    "ャ" => "ｬ", "ュ" => "ｭ", "ョ" => "ｮ",
    "ッ" => "ｯ"
);

my $ｼﾓﾅｲｽﾞﾚｷﾞｭﾗｰｴｸｽﾌﾟﾚｼｮﾝ = '[' . (join '', keys %ｼﾓﾅｲｽﾞﾃーﾌﾞﾙ) . ']';

sub 新 {
  my $class = shift;
  return bless {}, $class;
}

sub ｼﾓﾅｲｽﾞ{
  my $ｼﾓﾅｲｽﾞﾃｷｽﾄ = $_[1];
  $ｼﾓﾅｲｽﾞﾃｷｽﾄ =~ s/($ｼﾓﾅｲｽﾞﾚｷﾞｭﾗｰｴｸｽﾌﾟﾚｼｮﾝ)/$ｼﾓﾅｲｽﾞﾃーﾌﾞﾙ{$1}/ge;
  $ｼﾓﾅｲｽﾞﾃｷｽﾄ;
}

sub ﾊﾟｽｶﾗｲｽﾞ{
  my $ﾊﾟｽｶﾗｲｽﾞﾃｷｽﾄ = lc $_[1];
  $ﾊﾟｽｶﾗｲｽﾞﾃｷｽﾄ =~ s/_(\w)/uc $1/ge;
  $ﾊﾟｽｶﾗｲｽﾞﾃｷｽﾄ;
}

ﾄﾝﾇﾗｺ
